Repository: Backs/Collections.Analyzer
Catalog: Collections.Analyzer/Resources.*.resx
Languages: ru

# CI0001_Title
source: Redundant string conversion
ru: Избыточное преобразование строки

# RemoveRedundantCall
source: Remove method call {0}
ru: Удалить вызов метода {0}

# CI0002_Title
source: Redundant array conversion
ru: Избыточное преобразование массива

# CI0003_Title
source: Redundant enumerable conversion
ru: Избыточное преобразование типа

# CI0004_Title
source: Not optimal List<char> constructor usage
ru: Не оптимальное использование конструктора List<char>

# AddToCharArray
source: Add ToCharArray call
ru: Добавить вызов метода ToCharArray

# ReplaceWithToCharArray
source: Replace with ToCharArray call
ru: Заменить на вызов метода ToCharArray

source: Replace with Count call
ru: Заменить на вызов метода Count

# CI0005_Title
source: Not optimal count of collection items
ru: Неоптимальный подсчет элементов коллекции

# CI0006_Title
source: Collection initializer is used without capacity
ru: Инициализация коллекции используется без указания первоначального размера

# NotEnoughCapacity
source: Initial collection capacity is less than amount of actual values
ru: Первоначальный размер коллекции не соответсвует количеству элементов при инициализации

source: Set actual capacity
ru: Указать первоначальный размер коллекции
